zephyrproject-rtos/hal_nxp/dts/nxp/nxp_imx/rt/MIMXRT758SGAWAR-pinctrl.h
#define PINT0_PINT0_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define PINT0_PINT1_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define PINT0_PINT2_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define PINT0_PINT3_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define PINT0_PINT4_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define PINT0_PINT5_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define PINT0_PINT6_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define PINT0_PINT7_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define SAI1_RX_SYNC_PIO0_19 IOPCTL_MUX(0, 19, 5) /* PIO0_19 */
#define SCT0_IN0_PIO0_19 IOPCTL_MUX(0, 19, 2) /* PIO0_19 */
#define SCT0_IN1_PIO0_19 IOPCTL_MUX(0, 19, 2) /* PIO0_19 */
#define SCT0_IN2_PIO0_19 IOPCTL_MUX(0, 19, 2) /* PIO0_19 */
#define SCT0_IN3_PIO0_19 IOPCTL_MUX(0, 19, 2) /* PIO0_19 */
#define SCT0_IN4_PIO0_19 IOPCTL_MUX(0, 19, 2) /* PIO0_19 */
#define SCT0_IN5_PIO0_19 IOPCTL_MUX(0, 19, 2) /* PIO0_19 */
#define SCT0_IN6_PIO0_19 IOPCTL_MUX(0, 19, 2) /* PIO0_19 */
#define SCT0_OUT2_PIO0_19 IOPCTL_MUX(0, 19, 3) /* PIO0_19 */
#define CTIMER2_MATCH3_PIO0_20 IOPCTL_MUX(0, 20, 4) /* PIO0_20 */
#define GPIO0_GPIO20_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define LP_FLEXCOMM6_P3_PIO0_20 IOPCTL_MUX(0, 20, 1) /* PIO0_20 */
#define PINT0_PINT0_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define PINT0_PINT1_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define PINT0_PINT2_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define PINT0_PINT3_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define PINT0_PINT4_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define PINT0_PINT5_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define PINT0_PINT6_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define PINT0_PINT7_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define SAI1_TX_BCLK_PIO0_20 IOPCTL_MUX(0, 20, 5) /* PIO0_20 */
#define SCT0_IN0_PIO0_20 IOPCTL_MUX(0, 20, 2) /* PIO0_20 */
#define SCT0_IN1_PIO0_20 IOPCTL_MUX(0, 20, 2) /* PIO0_20 */
#define SCT0_IN2_PIO0_20 IOPCTL_MUX(0, 20, 2) /* PIO0_20 */
#define SCT0_IN3_PIO0_20 IOPCTL_MUX(0, 20, 2) /* PIO0_20 */
#define SCT0_IN4_PIO0_20 IOPCTL_MUX(0, 20, 2) /* PIO0_20 */
#define SCT0_IN5_PIO0_20 IOPCTL_MUX(0, 20, 2) /* PIO0_20 */
#define SCT0_IN6_PIO0_20 IOPCTL_MUX(0, 20, 2) /* PIO0_20 */
#define SCT0_OUT3_PIO0_20 IOPCTL_MUX(0, 20, 3) /* PIO0_20 */
#define CLKCTL0_MCLK_PIO0_21 IOPCTL_MUX(0, 21, 6) /* PIO0_21 */
#define CTIMER0_CAPTURE0_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER0_CAPTURE1_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER0_CAPTURE2_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER0_CAPTURE3_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER1_CAPTURE0_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER1_CAPTURE1_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER1_CAPTURE2_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER1_CAPTURE3_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER2_CAPTURE0_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER2_CAPTURE1_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER2_CAPTURE2_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER2_CAPTURE3_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER3_CAPTURE0_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER3_CAPTURE1_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER3_CAPTURE2_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER3_CAPTURE3_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER4_CAPTURE0_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER4_CAPTURE1_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER4_CAPTURE2_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER4_CAPTURE3_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER_C_INP4_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define GPIO0_GPIO21_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define LP_FLEXCOMM6_P0_PIO0_21 IOPCTL_MUX(0, 21, 1) /* PIO0_21 */
#define PINT0_PINT0_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define PINT0_PINT1_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define PINT0_PINT2_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define PINT0_PINT3_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define PINT0_PINT4_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define PINT0_PINT5_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define PINT0_PINT6_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define PINT0_PINT7_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define SAI1_TX_DATA0_PIO0_21 IOPCTL_MUX(0, 21, 5) /* PIO0_21 */
#define SCT0_IN0_PIO0_21 IOPCTL_MUX(0, 21, 6) /* PIO0_21 */
#define SCT0_IN1_PIO0_21 IOPCTL_MUX(0, 21, 6) /* PIO0_21 */
#define SCT0_IN2_PIO0_21 IOPCTL_MUX(0, 21, 6) /* PIO0_21 */
#define SCT0_IN3_PIO0_21 IOPCTL_MUX(0, 21, 6) /* PIO0_21 */
#define SCT0_IN4_PIO0_21 IOPCTL_MUX(0, 21, 6) /* PIO0_21 */
#define SCT0_IN5_PIO0_21 IOPCTL_MUX(0, 21, 6) /* PIO0_21 */
#define SCT0_IN6_PIO0_21 IOPCTL_MUX(0, 21, 6) /* PIO0_21 */
#define SCT0_OUT6_PIO0_21 IOPCTL_MUX(0, 21, 3) /* PIO0_21 */
#define CLKCTL0_CLKOUT_VDD2_PIO0_22 IOPCTL_MUX(0, 22, 6) /* PIO0_22 */
#define CTIMER0_CAPTURE0_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER0_CAPTURE1_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER0_CAPTURE2_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER0_CAPTURE3_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER1_CAPTURE0_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER1_CAPTURE1_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER1_CAPTURE2_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER1_CAPTURE3_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER2_CAPTURE0_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER2_CAPTURE1_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER2_CAPTURE2_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER2_CAPTURE3_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER3_CAPTURE0_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER3_CAPTURE1_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER3_CAPTURE2_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER3_CAPTURE3_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER4_CAPTURE0_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER4_CAPTURE1_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER4_CAPTURE2_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER4_CAPTURE3_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER_C_INP5_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define GPIO0_GPIO22_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define LP_FLEXCOMM6_P1_PIO0_22 IOPCTL_MUX(0, 22, 1) /* PIO0_22 */
#define PINT0_PINT0_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define PINT0_PINT1_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define PINT0_PINT2_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define PINT0_PINT3_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define PINT0_PINT4_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define PINT0_PINT5_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define PINT0_PINT6_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define PINT0_PINT7_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define SAI1_TX_SYNC_PIO0_22 IOPCTL_MUX(0, 22, 5) /* PIO0_22 */
#define SCT0_IN0_PIO0_22 IOPCTL_MUX(0, 22, 2) /* PIO0_22 */
#define SCT0_IN1_PIO0_22 IOPCTL_MUX(0, 22, 2) /* PIO0_22 */
#define SCT0_IN2_PIO0_22 IOPCTL_MUX(0, 22, 2) /* PIO0_22 */
#define SCT0_IN3_PIO0_22 IOPCTL_MUX(0, 22, 2) /* PIO0_22 */
#define SCT0_IN4_PIO0_22 IOPCTL_MUX(0, 22, 2) /* PIO0_22 */
#define SCT0_IN5_PIO0_22 IOPCTL_MUX(0, 22, 2) /* PIO0_22 */
#define SCT0_IN6_PIO0_22 IOPCTL_MUX(0, 22, 2) /* PIO0_22 */
#define SCT0_OUT4_PIO0_22 IOPCTL_MUX(0, 22, 3) /* PIO0_22 */
#define CTIMER4_MATCH0_PIO0_31 IOPCTL_MUX(0, 31, 4) /* PIO0_31 */
#define GPIO0_GPIO31_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define LP_FLEXCOMM0_P0_PIO0_31 IOPCTL_MUX(0, 31, 1) /* PIO0_31 */
#define PINT0_PINT0_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define PINT0_PINT1_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define PINT0_PINT2_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define PINT0_PINT3_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define PINT0_PINT4_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define PINT0_PINT5_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define PINT0_PINT6_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define PINT0_PINT7_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define SCT0_OUT8_PIO0_31 IOPCTL_MUX(0, 31, 3) /* PIO0_31 */
#define UTICK0_CAPTURE2_PIO0_31 IOPCTL_MUX(0, 31, 2) /* PIO0_31 */
#define CTIMER4_MATCH1_PIO1_0 IOPCTL_MUX(0, 32, 4) /* PIO1_0 */
#define GPIO1_GPIO0_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define LP_FLEXCOMM0_P1_PIO1_0 IOPCTL_MUX(0, 32, 1) /* PIO1_0 */
#define PINT0_PINT0_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define PINT0_PINT1_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define PINT0_PINT2_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define PINT0_PINT3_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define PINT0_PINT4_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define PINT0_PINT5_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define PINT0_PINT6_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define PINT0_PINT7_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define SCT0_OUT9_PIO1_0 IOPCTL_MUX(0, 32, 3) /* PIO1_0 */
#define CTIMER0_CAPTURE0_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER0_CAPTURE1_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER0_CAPTURE2_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER0_CAPTURE3_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER1_CAPTURE0_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER1_CAPTURE1_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER1_CAPTURE2_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER1_CAPTURE3_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER2_CAPTURE0_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER2_CAPTURE1_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER2_CAPTURE2_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER2_CAPTURE3_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER3_CAPTURE0_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER3_CAPTURE1_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER3_CAPTURE2_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER3_CAPTURE3_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER4_CAPTURE0_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER4_CAPTURE1_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER4_CAPTURE2_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER4_CAPTURE3_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER_C_INP12_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define GPIO1_GPIO6_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define I3C1_PUR_PIO1_6 IOPCTL_MUX(0, 38, 5) /* PIO1_6 */
#define LP_FLEXCOMM1_P4_PIO1_6 IOPCTL_MUX(0, 38, 1) /* PIO1_6 */
#define PINT0_PINT0_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define PINT0_PINT1_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define PINT0_PINT2_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define PINT0_PINT3_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define PINT0_PINT4_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define PINT0_PINT5_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define PINT0_PINT6_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define PINT0_PINT7_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define SCT0_IN0_PIO1_6 IOPCTL_MUX(0, 38, 2) /* PIO1_6 */
#define SCT0_IN1_PIO1_6 IOPCTL_MUX(0, 38, 2) /* PIO1_6 */
#define SCT0_IN2_PIO1_6 IOPCTL_MUX(0, 38, 2) /* PIO1_6 */
#define SCT0_IN3_PIO1_6 IOPCTL_MUX(0, 38, 2) /* PIO1_6 */
#define SCT0_IN4_PIO1_6 IOPCTL_MUX(0, 38, 2) /* PIO1_6 */
#define SCT0_IN5_PIO1_6 IOPCTL_MUX(0, 38, 2) /* PIO1_6 */
#define SCT0_IN6_PIO1_6 IOPCTL_MUX(0, 38, 2) /* PIO1_6 */
#define SCT0_OUT0_PIO1_6 IOPCTL_MUX(0, 38, 3) /* PIO1_6 */
#define CTIMER0_CAPTURE0_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER0_CAPTURE1_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER0_CAPTURE2_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER0_CAPTURE3_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER1_CAPTURE0_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER1_CAPTURE1_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER1_CAPTURE2_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER1_CAPTURE3_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER2_CAPTURE0_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER2_CAPTURE1_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER2_CAPTURE2_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER2_CAPTURE3_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER3_CAPTURE0_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER3_CAPTURE1_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER3_CAPTURE2_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER3_CAPTURE3_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER4_CAPTURE0_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER4_CAPTURE1_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER4_CAPTURE2_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER4_CAPTURE3_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER_C_INP13_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define GPIO1_GPIO7_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define I3C1_SDA_PIO1_7 IOPCTL_MUX(0, 39, 5) /* PIO1_7 */
#define LP_FLEXCOMM1_P0_PIO1_7 IOPCTL_MUX(0, 39, 1) /* PIO1_7 */
#define PINT0_PINT0_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define PINT0_PINT1_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define PINT0_PINT2_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define PINT0_PINT3_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define PINT0_PINT4_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define PINT0_PINT5_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define PINT0_PINT6_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define PINT0_PINT7_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define SCT0_IN0_PIO1_7 IOPCTL_MUX(0, 39, 2) /* PIO1_7 */
#define SCT0_IN1_PIO1_7 IOPCTL_MUX(0, 39, 2) /* PIO1_7 */
#define SCT0_IN2_PIO1_7 IOPCTL_MUX(0, 39, 2) /* PIO1_7 */
#define SCT0_IN3_PIO1_7 IOPCTL_MUX(0, 39, 2) /* PIO1_7 */
#define SCT0_IN4_PIO1_7 IOPCTL_MUX(0, 39, 2) /* PIO1_7 */
#define SCT0_IN5_PIO1_7 IOPCTL_MUX(0, 39, 2) /* PIO1_7 */
#define SCT0_IN6_PIO1_7 IOPCTL_MUX(0, 39, 2) /* PIO1_7 */
#define SCT0_OUT1_PIO1_7 IOPCTL_MUX(0, 39, 3) /* PIO1_7 */
#define CTIMER0_CAPTURE0_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER0_CAPTURE1_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER0_CAPTURE2_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER0_CAPTURE3_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER1_CAPTURE0_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER1_CAPTURE1_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER1_CAPTURE2_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER1_CAPTURE3_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER2_CAPTURE0_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER2_CAPTURE1_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER2_CAPTURE2_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER2_CAPTURE3_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER3_CAPTURE0_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER3_CAPTURE1_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER3_CAPTURE2_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER3_CAPTURE3_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER4_CAPTURE0_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER4_CAPTURE1_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER4_CAPTURE2_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER4_CAPTURE3_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER_C_INP14_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define GPIO1_GPIO8_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define I3C1_SCL_PIO1_8 IOPCTL_MUX(0, 40, 5) /* PIO1_8 */
#define LP_FLEXCOMM1_P1_PIO1_8 IOPCTL_MUX(0, 40, 1) /* PIO1_8 */
#define PINT0_PINT0_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define PINT0_PINT1_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define PINT0_PINT2_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define PINT0_PINT3_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define PINT0_PINT4_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define PINT0_PINT5_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define PINT0_PINT6_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define PINT0_PINT7_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define SCT0_IN0_PIO1_8 IOPCTL_MUX(0, 40, 2) /* PIO1_8 */
#define SCT0_IN1_PIO1_8 IOPCTL_MUX(0, 40, 2) /* PIO1_8 */
#define SCT0_IN2_PIO1_8 IOPCTL_MUX(0, 40, 2) /* PIO1_8 */
#define SCT0_IN3_PIO1_8 IOPCTL_MUX(0, 40, 2) /* PIO1_8 */
#define SCT0_IN4_PIO1_8 IOPCTL_MUX(0, 40, 2) /* PIO1_8 */
#define SCT0_IN5_PIO1_8 IOPCTL_MUX(0, 40, 2) /* PIO1_8 */
#define SCT0_IN6_PIO1_8 IOPCTL_MUX(0, 40, 2) /* PIO1_8 */
#define SCT0_OUT2_PIO1_8 IOPCTL_MUX(0, 40, 3) /* PIO1_8 */
#define CLKCTL0_CLKIN_PIO1_9 IOPCTL_MUX(0, 41, 5) /* PIO1_9 */
#define CLKCTL3_CLKOUT_VDD1_PIO1_9 IOPCTL_MUX(0, 41, 6) /* PIO1_9 */
#define CTIMER0_CAPTURE0_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER0_CAPTURE1_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER0_CAPTURE2_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER0_CAPTURE3_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER1_CAPTURE0_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER1_CAPTURE1_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER1_CAPTURE2_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER1_CAPTURE3_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER2_CAPTURE0_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER2_CAPTURE1_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER2_CAPTURE2_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER2_CAPTURE3_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER3_CAPTURE0_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER3_CAPTURE1_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER3_CAPTURE2_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER3_CAPTURE3_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER4_CAPTURE0_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER4_CAPTURE1_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER4_CAPTURE2_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER4_CAPTURE3_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER_C_INP15_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define GPIO1_GPIO9_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define LP_FLEXCOMM1_P2_PIO1_9 IOPCTL_MUX(0, 41, 1) /* PIO1_9 */
#define PINT0_PINT0_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define PINT0_PINT1_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define PINT0_PINT2_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define PINT0_PINT3_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define PINT0_PINT4_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define PINT0_PINT5_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define PINT0_PINT6_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define PINT0_PINT7_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define SCT0_IN0_PIO1_9 IOPCTL_MUX(0, 41, 2) /* PIO1_9 */
#define SCT0_IN1_PIO1_9 IOPCTL_MUX(0, 41, 2) /* PIO1_9 */
#define SCT0_IN2_PIO1_9 IOPCTL_MUX(0, 41, 2) /* PIO1_9 */
#define SCT0_IN3_PIO1_9 IOPCTL_MUX(0, 41, 2) /* PIO1_9 */
#define SCT0_IN4_PIO1_9 IOPCTL_MUX(0, 41, 2) /* PIO1_9 */
#define SCT0_IN5_PIO1_9 IOPCTL_MUX(0, 41, 2) /* PIO1_9 */
#define SCT0_IN6_PIO1_9 IOPCTL_MUX(0, 41, 2) /* PIO1_9 */
#define SCT0_OUT3_PIO1_9 IOPCTL_MUX(0, 41, 3) /* PIO1_9 */
#define CLKCTL3_CLKOUT_VDD1_PIO1_10 IOPCTL_MUX(0, 42, 6) /* PIO1_10 */
#define CTIMER2_MATCH1_PIO1_10 IOPCTL_MUX(0, 42, 4) /* PIO1_10 */
#define GPIO1_GPIO10_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define LP_FLEXCOMM1_P3_PIO1_10 IOPCTL_MUX(0, 42, 1) /* PIO1_10 */
#define PINT0_PINT0_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define PINT0_PINT1_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define PINT0_PINT2_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define PINT0_PINT3_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define PINT0_PINT4_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define PINT0_PINT5_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define PINT0_PINT6_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define PINT0_PINT7_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define SWD_TRACECLK_PIO1_10 IOPCTL_MUX(0, 42, 5) /* PIO1_10 */
#define UTICK0_CAPTURE3_PIO1_10 IOPCTL_MUX(0, 42, 2) /* PIO1_10 */
#define CTIMER2_MATCH2_PIO1_11 IOPCTL_MUX(0, 43, 4) /* PIO1_11 */
#define GPIO1_GPIO11_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define LP_FLEXCOMM2_P0_PIO1_11 IOPCTL_MUX(0, 43, 1) /* PIO1_11 */
#define PINT0_PINT0_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define PINT0_PINT1_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define PINT0_PINT2_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define PINT0_PINT3_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define PINT0_PINT4_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define PINT0_PINT5_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define PINT0_PINT6_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define PINT0_PINT7_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define SWD_TRACEDATA0_PIO1_11 IOPCTL_MUX(0, 43, 5) /* PIO1_11 */
#define CTIMER1_MATCH1_PIO1_12 IOPCTL_MUX(0, 44, 4) /* PIO1_12 */
#define GPIO1_GPIO12_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define LP_FLEXCOMM2_P1_PIO1_12 IOPCTL_MUX(0, 44, 1) /* PIO1_12 */
#define PINT0_PINT0_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define PINT0_PINT1_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define PINT0_PINT2_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define PINT0_PINT3_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define PINT0_PINT4_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define PINT0_PINT5_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define PINT0_PINT6_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define PINT0_PINT7_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define SCT0_IN0_PIO1_12 IOPCTL_MUX(0, 44, 2) /* PIO1_12 */
#define SCT0_IN1_PIO1_12 IOPCTL_MUX(0, 44, 2) /* PIO1_12 */
#define SCT0_IN2_PIO1_12 IOPCTL_MUX(0, 44, 2) /* PIO1_12 */
#define SCT0_IN3_PIO1_12 IOPCTL_MUX(0, 44, 2) /* PIO1_12 */
#define SCT0_IN4_PIO1_12 IOPCTL_MUX(0, 44, 2) /* PIO1_12 */
#define SCT0_IN5_PIO1_12 IOPCTL_MUX(0, 44, 2) /* PIO1_12 */
#define SCT0_IN6_PIO1_12 IOPCTL_MUX(0, 44, 2) /* PIO1_12 */
#define SCT0_OUT9_PIO1_12 IOPCTL_MUX(0, 44, 3) /* PIO1_12 */
#define SWD_TRACEDATA1_PIO1_12 IOPCTL_MUX(0, 44, 5) /* PIO1_12 */
#define CTIMER2_MATCH3_PIO1_13 IOPCTL_MUX(0, 45, 4) /* PIO1_13 */
#define GPIO1_GPIO13_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define LP_FLEXCOMM2_P4_PIO1_13 IOPCTL_MUX(0, 45, 1) /* PIO1_13 */
#define PINT0_PINT0_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define PINT0_PINT1_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define PINT0_PINT2_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define PINT0_PINT3_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define PINT0_PINT4_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define PINT0_PINT5_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define PINT0_PINT6_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define PINT0_PINT7_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define PIN_32KHZ_CLKOUT_PIO1_13 IOPCTL_MUX(0, 45, 6) /* PIO1_13 */
#define SWD_TRACEDATA2_PIO1_13 IOPCTL_MUX(0, 45, 5) /* PIO1_13 */
#define UTICK0_CAPTURE1_PIO1_13 IOPCTL_MUX(0, 45, 2) /* PIO1_13 */
#define CTIMER3_MATCH0_PIO1_14 IOPCTL_MUX(0, 46, 4) /* PIO1_14 */
#define GPIO1_GPIO14_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define LP_FLEXCOMM2_P2_PIO1_14 IOPCTL_MUX(0, 46, 1) /* PIO1_14 */
#define PINT0_PINT0_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define PINT0_PINT1_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define PINT0_PINT2_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define PINT0_PINT3_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define PINT0_PINT4_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define PINT0_PINT5_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define PINT0_PINT6_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define PINT0_PINT7_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define SWD_TRACEDATA3_PIO1_14 IOPCTL_MUX(0, 46, 5) /* PIO1_14 */
